//-----------------------------------------------

let age = 365 * prompt("Введите Ваш возраст:");
console.log(`Ваш возраст ${age} дней.`);


// ------------------------------------------------

let number1 = +prompt("Введите первое число:");
let number2 = +prompt("Введите второе число:");
const sum = number1 + number2;
console.log("Сумма ваших чисел равна: " + sum);

// -----------------------------------------------

let number = +prompt("Введите число:");

if ( number === 0) {
    console.log("Число равно нулю");
} else if (number % 2 === 0){
    console.log("Число четное");
} else {
    console.log("Число нечетное");
}

// -----------------------------------------------

let isNotANumber = isNaN(+prompt("Введите что-нибудь:"));

if (isNotANumber == false){
    console.log("Это значение можно преобразовать в число");
} else {
    console.log("Это значение преобразовать в число не получится. Получится NaN");
}